# Используем официальный образ Node.js (например, alpine-версия для легкости)
FROM node:20-alpine

# Задаём рабочую директорию в контейнере
WORKDIR /app

# Копируем файлы зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем весь исходный код приложения в контейнер
COPY . .

# Собираем приложение (для production сборки)
RUN npm run build

# Открываем порт (по умолчанию Nuxt работает на 3000 порту)
EXPOSE 3000

# Запускаем приложение
CMD ["node", ".output/server/index.mjs"]
